Linux/LinuxOS/批量修改文件.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>批量修改文件</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="批量修改文件"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-19 19:56:19 CST"/>
<meta name="author" content="visaya fan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="H" href="../../index.html#linuxos"> HOME </a>
</div>


<div id="content">
<h1 class="title">批量修改文件</h1>


<script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script>
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/vf.css" />
<script src="../../Layout/JS/bootstrap_old.js"></script>




<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 利用sed与grep实现批量替换</a></li>
<li><a href="#sec-2">2 在文件末尾添加</a></li>
<li><a href="#sec-3">3 读文件／写文件</a></li>
<li><a href="#sec-4">4 利用sed删除行</a></li>
<li><a href="#sec-5">5 多次编辑</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 利用sed与grep实现批量替换</h2>
<div class="outline-text-2" id="text-1">

<p>利用grep和sed来实现：<br/>
</p>
<p><br/>
<pre class="example">sed -i "s/old/new/g" `grep "old" -rl directory`
</pre>

grep命令的-r选项表递归，-l选项表&ndash;files-with-matches匹配的文件，即将匹配的文件作为sed的参数。<br/>
sed命令-i表示 &ndash;in-place即原地修改，s表替换，g表全局。<br/>
</p>
<p><br/>
</p>
<p><br/>
<pre class="example">sed -i 's/old/&amp;new/g' filename
</pre>

&amp;表示前面欲替换的内容，即old，即把old替换成oldnew。<br/>
</p>
<p><br/>
如果没有子目录，只使用sed即可：<br/>
</p>
<p><br/>
<pre class="example">sed -i "s/old/new/g" *
</pre>

*表匹配，即所有文件。<br/>
</p>
<p><br/>
例如下面命令把当前目录及其子目录下所有../template2.org替换成../../template.org：<br/>
</p>
<p><br/>
<pre class="example">sed -i "s|../template2.org|../../template.org|g" `grep "../template2.org" -rl .`
</pre>

利用得当可以极大提高效率。<br/>
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 在文件末尾添加</h2>
<div class="outline-text-2" id="text-2">


<p><br/>
<pre class="example">sed '$a \toadd' `find -name "*.org"`
</pre>

  $a表文件尾，\表换行，即在后缀为org文件中的文件末尾添加toadd<br/>
  其中a表添加，与i的区别在于：a在后面添加，i在前面添加，所以上面命令中如果把a换成i则在最后一行的前面一行添加toadd<br/>
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 读文件／写文件</h2>
<div class="outline-text-2" id="text-3">


<p><br/>
<pre class="example">sed '/abc/r filename1' `find -name "*.org"`
</pre>

  用filename1中的内容替换掉目录下以后缀为org文件中的abc<br/>
  同理用w即把内容写到指定文件中。<br/>
</p>
<p><br/>
<pre class="example">sed '/div/w div.org' filename   #将filename中有div的行写到div.org文件中。
</pre>

</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 利用sed删除行</h2>
<div class="outline-text-2" id="text-4">


<p><br/>
<pre class="example">sed '/abc/ d' filename          #删除filename中含abc的行
sed '3d' filename               #删除filename第3行
sed '$d' filename               #删除filename最后一行
sed '3,$d' filename             #删除filename第3行到最后一行
</pre>

  其中逗号表范围，例如：<br/>
</p>
<p><br/>
<pre class="example">sed -n /abc/,/def/p filename
</pre>

  打印第一个匹配abc的行到最后一个匹配def行之间的行，其中，表范围<br/>
</p></div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 多次编辑</h2>
<div class="outline-text-2" id="text-5">


<p><br/>
<pre class="example">sed -e 's/div/divvvv/g' -e 's/divvvv/div/g' a.org #先把所有div换成divvvv，再把所有divvvvv换成div
</pre>

  -e表示多次编辑，相当于调用多次sed命令，每次内容为前一个-e到后一个-e之间的命令。<br/>
</p>
<p>  <br/>
<script src="../../Layout/JS/disqus-comment.js"></script>
<div id="disqus_thread">
</div>
</p></div>
</div>
</div>

</body>
</html>
